snlkuharlocal/src/Catalogs/РазмерыЧашки/РазмерыЧашки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазмерыЧашки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеЧестногоЗнака</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/РазмерыЧашки/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	если ЗначениеЗаполнено(объект.Ссылка) тогда
		Для Каждого СтрокаС Из ЗначенияСвойств Цикл
			МЗ = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();	
			
			МЗ.Объект	= Объект.Ссылка;
			МЗ.Свойство = СтрокаС.Свойство;
			МЗ.Значение	= СтрокаС.Значение;
			
			Если ЗначениеЗаполнено(МЗ.Значение) Тогда
				МЗ.Записать();
			Иначе
				МЗ.Удалить();		
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьЗначенияХарактеристик()
	если ЗначениеЗаполнено(Объект.Ссылка) тогда
		//ЗначенияСвойств = Справочники.РазмерыЧашки.ПолучитьЗначенияСвойств(Объект.Ссылка);
			ЗначениеВРеквизитФормы(Справочники.РазмерыЧашки.ПолучитьЗначенияСвойств(Объект.Ссылка),"ЗначенияСвойств");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьЗначенияХарактеристик();
	
КонецПроцедуры
